In [2]:
import datetime

In [3]:

dt = datetime.datetime(2023, 1, 29, 9, 30)

In [4]:
one_hour_later = dt + datetime.timedelta(hours=1)

In [5]:
one_hour_later

datetime.datetime(2023, 1, 29, 10, 30)

In [6]:
one_day_earlier = dt - datetime.timedelta(days=1)

In [7]:
one_day_earlier

datetime.datetime(2023, 1, 28, 9, 30)

In [8]:
dt_now = datetime.datetime.now()

In [9]:
formatted_dt = dt.strftime("%d-%m-%Y %H:%M:%S")

In [10]:
formatted_dt

'29-01-2023 09:30:00'

In [11]:
str(str(datetime.datetime.now()).split(" ")[0])

'2023-04-09'

In [12]:
import pandas as pd

In [13]:
df = pd.DataFrame({"id":[1,2,3,4,5,6,7,8,9,10],
              "name":["hiten","manav","hardeep","akshy","sumit","varun","shubham","loyum","virat","sagar"],
              "date_of_joining":[datetime.datetime.now().strftime("%d-%m-%Y")]*10})

In [14]:
df

   id     name date_of_joining
0   1    hiten      09-04-2023
1   2    manav      09-04-2023
2   3  hardeep      09-04-2023
3   4    akshy      09-04-2023
4   5    sumit      09-04-2023
5   6    varun      09-04-2023
6   7  shubham      09-04-2023
7   8    loyum      09-04-2023
8   9    virat      09-04-2023
9  10    sagar      09-04-2023

In [15]:
todays_date = str(str(datetime.datetime.now()).split(" ")[0])

In [16]:
df['today'] = todays_date

In [17]:
df['today'] = pd.to_datetime(df['today'],dayfirst=True).dt.strftime('%Y-%m-%d')

In [18]:
df

   id     name date_of_joining       today
0   1    hiten      09-04-2023  2023-04-09
1   2    manav      09-04-2023  2023-04-09
2   3  hardeep      09-04-2023  2023-04-09
3   4    akshy      09-04-2023  2023-04-09
4   5    sumit      09-04-2023  2023-04-09
5   6    varun      09-04-2023  2023-04-09
6   7  shubham      09-04-2023  2023-04-09
7   8    loyum      09-04-2023  2023-04-09
8   9    virat      09-04-2023  2023-04-09
9  10    sagar      09-04-2023  2023-04-09

In [20]:
#range of date
pd.date_range(start="2023-01-01", periods=10)

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df['range_date'] = pd.date_range(start="2023-07-24", periods=10)

In [24]:
df

   id     name date_of_joining       today range_date
0   1    hiten      09-04-2023  2023-04-09 2023-07-24
1   2    manav      09-04-2023  2023-04-09 2023-07-25
2   3  hardeep      09-04-2023  2023-04-09 2023-07-26
3   4    akshy      09-04-2023  2023-04-09 2023-07-27
4   5    sumit      09-04-2023  2023-04-09 2023-07-28
5   6    varun      09-04-2023  2023-04-09 2023-07-29
6   7  shubham      09-04-2023  2023-04-09 2023-07-30
7   8    loyum      09-04-2023  2023-04-09 2023-07-31
8   9    virat      09-04-2023  2023-04-09 2023-08-01
9  10    sagar      09-04-2023  2023-04-09 2023-08-02

In [3]:
#wheather_df
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.rand(10,2)*5,
                    index = pd.date_range(start="2023-01-01", periods=10),
                    columns = ["Tokyo","Beijing"])

df.head()

               Tokyo   Beijing
2023-01-01  0.764971  3.681911
2023-01-02  2.008664  1.115858
2023-01-03  0.356087  0.644809
2023-01-04  0.227562  2.530535
2023-01-05  3.516536  3.891133